## Plan Result (1037: staging - TerraformPlanApply)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.bais_bau_reader
* Update
  * azurerm_key_vault.baubais_kv
  * module.storage.azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault.baubais_kv will be updated in-place
  ~ resource "azurerm_key_vault" "baubais_kv" {
      ~ access_policy                   = [
            # (2 unchanged elements hidden)
            {
                application_id          = null
                certificate_permissions = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "ManageContacts",
                    "ManageIssuers",
                    "GetIssuers",
                    "ListIssuers",
                    "SetIssuers",
                    "DeleteIssuers",
                ]
                key_permissions         = [
                    "Get",
                    "List",
                    "Update",
                    "Create",
                    "Import",
                    "Delete",
                    "Recover",
                    "Backup",
                    "Restore",
                    "GetRotationPolicy",
                    "SetRotationPolicy",
                    "Rotate",
                ]
                object_id               = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
                secret_permissions      = [
                    "Get",
                    "List",
                    "Set",
                    "Delete",
                    "Purge",
                ]
                storage_permissions     = []
                tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
            },
          - {
              - certificate_permissions = []
              - key_permissions         = []
              - object_id               = "fb7d9d98-9e59-42cf-a9fd-a32c3990170e"
              - secret_permissions      = [
                  - "Get",
                  - "List",
                  - "Set",
                  - "Delete",
                  - "Recover",
                  - "Backup",
                  - "Restore",
                ]
              - storage_permissions     = []
              - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
                # (1 unchanged attribute hidden)
            },
        ]
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.KeyVault/vaults/baubais-stg-kv"
        name                            = "baubais-stg-kv"
        tags                            = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_role_assignment.bais_bau_reader will be created
  + resource "azurerm_role_assignment" "bais_bau_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6c9985b3-1f04-4701-b9d3-dc01b1dc610e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage File Data Privileged Reader"
      + scope                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/bau-bais_stg_resource_group/providers/Microsoft.Storage/storageAccounts/baubaisstg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.storage.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/baubais-data-factory-rg-stg/providers/Microsoft.Storage/storageAccounts/synapsebaubaisstg"
        name                               = "synapsebaubaisstg"
        tags                               = {
            "application"  = "baubais"
            "builtFrom"    = "hmcts/juror-er-infra"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "staging"
        }
        # (96 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":23,"Program":"tfcmt","SHA1":"","Target":"1037: staging - TerraformPlanApply","Vars":{}} -->